Monard2033/nRF52840-Transmitter/src/main - Copy (6).c
    LOG_INF("Queuing pulse: color=%d, duration=%d ms, count=%d", color, duration_ms, pulse_count);

    // Store in queue
    pulse_queue[queue_index].color = color;
    pulse_queue[queue_index].duration_ms = duration_ms; // Each pulse duration
    pulse_queue[queue_index].count = pulse_count;
    pulse_queue[queue_index].active = false;
    queue_index++;

    // Start the first pulse if not already pulsing
    if (!pulsing) {
        pulsing = true;
        pulse_color = pulse_queue[0].color;
        pulse_duration_ms = pulse_queue[0].duration_ms; // Duration of each pulse
        pulse_count = pulse_queue[0].count;
        remaining_pulses = pulse_count;
        current_step = 0;

        // Calculate total steps per pulse (rising + falling)
        total_steps = (pulse_duration_ms + (2 * step_delay - 1)) / (2 * step_delay);
        if (total_steps < 10) total_steps = 10; // Minimum for smoothness
        LOG_INF("Calculated total_steps=%d per pulse for duration %d ms", total_steps, pulse_duration_ms);

        total_execution_ms = pulse_duration_ms * pulse_count + grace_period_ms;
        LOG_INF("Total execution time including grace period: %d ms", total_execution_ms);

        pulse_queue[0].active = true;
        k_timer_start(&pulse_timer, K_NO_WAIT, K_MSEC(step_delay));
    }
}

void pulse_timer_handler(struct k_timer *timer) {
    if (!pulsing) return;

    uint32_t red_pulse = 0, green_pulse = 0, blue_pulse = 0;

    // Calculate total steps for all pulses
    uint32_t total_pulse_steps = total_steps * 2; // Rising + falling per pulse

    // Determine current pulse and step within it
    uint32_t current_pulse = current_step / total_pulse_steps;
    uint32_t step_in_pulse = current_step % total_pulse_steps;

    if (current_pulse < pulses) {
        if (step_in_pulse < total_steps) {
            // Rising phase: 0 to max_period (off to on) for current pulse
            uint32_t duty = (step_in_pulse * max_period) / total_steps;
            switch (pulse_color) {
                case LED_RED: red_pulse = duty; break;
                case LED_GREEN: green_pulse = duty; break;
                case LED_BLUE: blue_pulse = duty; break;
                case LED_YELLOW:
                    red_pulse = duty;
                    green_pulse = duty;
                    break;
                case LED_ORANGE:
                    red_pulse = duty;
                    green_pulse = duty / 2; // 50% dimming
                    break;
                case LED_MAGENTA:
                    red_pulse = duty;
                    blue_pulse = duty;
                    break;
                case LED_WHITE:
                    red_pulse = duty;
                    green_pulse = duty;
                    blue_pulse = duty;
                    break;
                case LED_GREEN_OFF:
                case LED_OFF:
                    red_pulse = 0;
                    green_pulse = 0;
                    blue_pulse = 0;
                    break;
                default: break;
            }
        } else if (step_in_pulse < total_pulse_steps) {
            // Falling phase: max_period to 0 (on to off) for current pulse
            uint32_t duty = max_period - ((step_in_pulse - total_steps) * max_period) / total_steps;
            switch (pulse_color) {
                case LED_RED: red_pulse = duty; break;
                case LED_GREEN: green_pulse = duty; break;
                case LED_BLUE: blue_pulse = duty; break;
                case LED_YELLOW:
                    red_pulse = duty;
                    green_pulse = duty;
                    break;
                case LED_ORANGE:
                    red_pulse = duty;
                    green_pulse = duty / 2;
                    break;
                case LED_MAGENTA:
                    red_pulse = duty;
                    blue_pulse = duty;
                    break;
                case LED_WHITE:
                    red_pulse = duty;
                    green_pulse = duty;
                    blue_pulse = duty;
                    break;
                case LED_GREEN_OFF:
                case LED_OFF:
                    red_pulse = 0;
                    green_pulse = 0;
                    blue_pulse = 0;
                    break;
                default: break;
            }
        }
    } else if ((uint32_t)(current_step - (pulses * total_pulse_steps)) * step_delay < grace_period_ms) {
        // Grace period: keep LEDs off, maintain pulsing state
        red_pulse = 0;
        green_pulse = 0;
        blue_pulse = 0;
        if (current_step == pulses * total_pulse_steps) {
            LOG_INF("Entering grace period of %d ms", grace_period_ms);
        }
    } else {
        // Grace period complete, move to next in queue or stop
        pulsing = false;
        current_step = 0;
        pwm_set_dt(&pwm_red, max_period, 0); // Ensure off
        pwm_set_dt(&pwm_green, max_period, 0);
        pwm_set_dt(&pwm_blue, max_period, 0);
        k_timer_stop(&pulse_timer);
        LOG_INF("Pulse cycle complete, system unlocked");

        // Shift queue and start next pulse if available
        if (queue_index > 0) {
            for (uint8_t i = 0; i < queue_index - 1; i++) {
                pulse_queue[i] = pulse_queue[i + 1];
            }
            queue_index--;
            if (queue_index > 0) {
                pulsing = true;
                pulse_color = pulse_queue[0].color;
                pulse_duration_ms = pulse_queue[0].duration_ms;
                pulses = pulse_queue[0].count;
                remaining_pulses = pulses;
                current_step = 0;

                total_steps = (pulse_duration_ms + (2 * step_delay - 1)) / (2 * step_delay);
                if (total_steps < 10) total_steps = 10;
                LOG_INF("Calculated total_steps=%d per pulse for duration %d ms", total_steps, pulse_duration_ms);

                total_execution_ms = pulse_duration_ms * pulses + grace_period_ms;
                LOG_INF("Total execution time including grace period: %d ms", total_execution_ms);

