Monard2033/nRF52840-Transmitter/src/main - Copy (6).c
                pulse_queue[0].active = true;
                k_timer_start(&pulse_timer, K_NO_WAIT, K_MSEC(step_delay));
            }
        }
        return;
    }

    // Apply PWM updates
    pwm_set_dt(&pwm_red, max_period, red_pulse);
    pwm_set_dt(&pwm_green, max_period, green_pulse);
    pwm_set_dt(&pwm_blue, max_period, blue_pulse);
    current_step++;
    k_timer_start(&pulse_timer, K_MSEC(step_delay), K_NO_WAIT);
}

void led_timer_handler(struct k_timer *timer)
{
    if (!is_charging){
        pulse_led(LED_RED, 1000,1);
    }
}

void battery_warning_timer_handler(struct k_timer *timer)
{
    if (!is_charging && battery_warning_active){
        k_timer_start(&battery_pulse_timer, K_NO_WAIT, K_NO_WAIT);
    }
}

void battery_pulse_timer_handler(struct k_timer *timer) {
    if (pulses < 8 && !is_charging) {
        pulse_led(LED_RED, 1000,3); // Fade in/out over 1s
        pulses++;
    } else {
        pulses = 0;
        k_timer_stop(&battery_pulse_timer);
        if (battery_warning_active && !is_charging) {
            k_timer_start(&battery_warning_timer, K_MINUTES(5), K_NO_WAIT);
        }
    }
}

static void charging_pulse_timer_handler(struct k_timer *timer) {
    if (is_charging) {
        pulse_led(LED_GREEN, 2000,1); // 2s fade cycle
        k_timer_start(&charging_pulse_timer, K_MSEC(2000), K_NO_WAIT);
    } else {
        pulse_led(LED_RED, 3000,1); // 3 pulses of 1.5s each
        k_timer_stop(&charging_pulse_timer);
        set_led_status(LED_OFF);
    }
}

void enter_low_power(struct k_timer *dummy)
{
    LOG_INF("Inactivity detected. Preparing to enter System OFF mode.");
    int retry_count = 0;
    const int max_retries = 3;
    while (retry_count < max_retries && !esb_is_idle())
    {
        LOG_INF("ESB is busy, waiting %d/%d...", retry_count + 1, max_retries);
        k_sleep(K_MSEC(20));
        retry_count++;
    }
    if (!esb_is_idle())
    {
        LOG_INF("ESB busy after %d retries", max_retries);
    }
    LOG_INF("Entering System OFF mode");
    k_timer_stop(&led_timer);
    k_timer_stop(&battery_warning_timer);
    k_timer_stop(&battery_pulse_timer);
    k_timer_stop(&charging_pulse_timer);
    k_timer_stop(&battery_check_timer);
    esb_disable();
    pulse_led(LED_RED, 1000,3);
    set_led_status(LED_OFF);
}

void update_sleep_timeout(void)
{
    int64_t now_ms = k_uptime_get();
    k_ticks_t now_ticks = k_ms_to_ticks_ceil32(now_ms);
    k_ticks_t last_ticks = k_ms_to_ticks_ceil32(last_sleep_time);
    k_ticks_t grace_ticks = k_ms_to_ticks_ceil32(GRACE_PERIOD_MS);
    if (last_sleep_time != 0 && (now_ticks - last_ticks) < grace_ticks)
    {
        wakeup_count++;
        if (wakeup_count == 1)
        {
            current_timeout = K_SECONDS(30); //original 2 minutes
            LOG_INF("Quick wakeup detected, increasing sleep timeout to 2 minutes.");
        }
        else if (wakeup_count >= 2)
        {
            current_timeout = K_SECONDS(180);
            LOG_INF("Quick wakeup detected, increasing sleep timeout to 3 minutes.");
            wakeup_count = 2;
        }
        else if (wakeup_count >= 3)
        {
            current_timeout = K_SECONDS(240);
            LOG_INF("Quick wakeup detected, increasing sleep timeout to 4 minutes.");
            wakeup_count = 3;
        }
        else if (wakeup_count >= 4)
        {
            current_timeout = K_SECONDS(300);
            LOG_INF("Quick wakeup again, capping sleep timeout at 5 minutes.");
            wakeup_count = 4;
        }
    }
    else
    {
        wakeup_count = 0;
        current_timeout = BASE_TIMEOUT;
        LOG_INF("Long inactivity or fresh start, resetting sleep timeout to 1 minute.");
    }
    last_sleep_time = now_ms;
}

void pin_activity_handler(const struct device *dev, struct gpio_callback *cb, uint32_t pins)
{
    update_sleep_timeout();
    k_timer_start(&inactivity_timer, K_NO_WAIT, current_timeout);
    set_led_status(LED_BLUE);
    k_timer_start(&led_timer, K_SECONDS(4), K_NO_WAIT);
    esb_start_tx();
    LOG_INF("Pin activity detected, resetting inactivity timer");
}
/* // GPIO interrupt handler
void pin_activity_handler(const struct device *dev, struct gpio_callback *cb, uint32_t pins) {
    if (pins & BIT(data_plus.pin)) {
        LOG_INF("Pin activity detected P%d on DATA_PLUS, resetting inactivity timer", gpio_port_get_raw(data_plus.port, &pins));
        pulse_led(LED_BLUE, 100, 1); // Indicate activity
    }
    if (pins & BIT(data_minus.pin)) {
        LOG_INF("Pin activity detected P%d on DATA_MINUS, resetting inactivity timer", gpio_port_get_raw(data_minus.port, &pins));
        pulse_led(LED_BLUE, 100, 1); // Indicate activity
    }
    update_sleep_timeout();
    k_timer_start(&led_timer, K_SECONDS(4), K_NO_WAIT);
    if (esb_start_tx() == 0) {
        pulse_led(LED_GREEN, 100, 1); // Success
    } else {
        pulse_led(LED_RED, 100, 3); // Failure
    }
} */

int check_battery_status(void) {
    int16_t buf;
    int battery_led_color = LED_OFF;
    struct adc_sequence sequence = {
        .channels = adc.channel_id,
        .buffer = &buf,
        .buffer_size = sizeof(buf),
        .oversampling = adc.oversampling,
        .resolution = adc.resolution,
    };
        if (!device_is_ready(adc.dev)) {
            LOG_ERR("ADC device not ready: %s", adc.dev->name);
            return 0;
        }

        int err = adc_channel_setup_dt(&adc);
        if (err < 0) {
            LOG_ERR("ADC channel setup failed (ID: %u, err: %d)", adc.channel_id, err);
            return 0;
        }
        err = adc_sequence_init_dt(&adc, &sequence);
        if (err < 0) {
            LOG_ERR("ADC sequence init failed (channel ID: %u, resolution: %u, err: %d)",
                    adc.channel_id, sequence.resolution, err);
            return 0;
        }
        err = adc_read(adc.dev, &sequence);
        if (err < 0) {
            LOG_ERR("ADC read failed (channel ID: %u, buffer size: %u, err: %d)",
                    adc.channel_id, sequence.buffer_size, err);
            return 0;
        }

    uint32_t adc_value = buf;
    LOG_INF("ADC READ VALUE: %d", adc_value);
    uint32_t voltage_mv = (adc_value * 1.45);
    LOG_INF("VOLTAGE mV: %d mV", voltage_mv);
    battery_level = (voltage_mv - BATTERY_MIN_VOLTAGE) * 100 / (BATTERY_MAX_VOLTAGE - BATTERY_MIN_VOLTAGE);
    if (battery_level < 0) battery_level = 0;
    if (battery_level > 100) battery_level = 100;

    LOG_INF("Battery level: %d%%, Voltage: %d mV", battery_level, voltage_mv);

