Monard2033/nRF52840-Transmitter/src/main - Copy (6).c
        // Set LED color based on battery level
    if (battery_level >= 75 && battery_level <= 100) {
        battery_led_color = LED_GREEN;
    } else if (battery_level >= 50 && battery_level < 75) {
        battery_led_color = LED_YELLOW;
    } else if (battery_level >= 25 && battery_level < 50) {
        battery_led_color = LED_ORANGE;
    } else if (battery_level >= 0 && battery_level < 25) {
        battery_led_color = LED_RED;
    } else {
        battery_led_color = LED_OFF; // Or a warning color like LED_ORANGE
    }
    set_led_status(battery_led_color);

    /// First 5 seconds override logic
    if (k_uptime_get() < Z_TIMEOUT_MS_TICKS(5000)) {
        LOG_INF("System just started, setting battery LED color based on level %d%%", battery_level);
        set_led_status(battery_led_color); // Use the determined color
        k_timer_start(&led_timer, K_SECONDS(5), K_NO_WAIT);
        set_led_status(LED_OFF); // Turn off after 5 seconds
    }

    // Detect charging or full battery
    int64_t now_ms = k_uptime_get();
    if (now_ms - last_voltage_time >= 1000) {
        if (last_voltage_mv > 0) {
            if ((voltage_mv - last_voltage_mv) > CHARGING_THRESHOLD_DELTA) {
                is_charging = true;
                k_timer_start(&charging_pulse_timer, K_MSEC(500), K_NO_WAIT);
                battery_warning_active = false;
                k_timer_stop(&battery_warning_timer);
                k_timer_stop(&battery_pulse_timer);
                LOG_INF("Charging detected, starting green led");
            } else if (is_charging && voltage_mv >= FULL_CHARGE_THRESHOLD) {
                k_timer_stop(&charging_pulse_timer);
                set_led_status(LED_GREEN);
                max_voltage_mv = voltage_mv;
                LOG_INF("Full charge reached, static green");
            }
        }
        last_voltage_time = now_ms;
        last_voltage_mv = voltage_mv;
        if (voltage_mv > max_voltage_mv) {
            max_voltage_mv = voltage_mv;
        }
    }

    // Low battery alert
    if (battery_level < BATTERY_CRITICAL_THRESHOLD && !is_charging && !battery_warning_active) {
        battery_warning_active = true;
        k_timer_start(&battery_warning_timer, K_NO_WAIT, K_NO_WAIT);
    }

    // Send via ESB
    //send_battery_level(voltage_mv);
    return voltage_mv;
}
void battery_check_timer_handler(struct k_timer *dummy) {
   check_battery_status();
}

static void usb_status_cb(enum usb_dc_status_code status, const uint8_t *param)
{
    ARG_UNUSED(param);
    switch (status)
    {
    case USB_DC_CONFIGURED:
        LOG_INF("USB_DC_CONFIGURED received, setting usb_configured = true");
        usb_configured = true;
        k_sem_give(&usb_configured_sem);
        break;
    case USB_DC_DISCONNECTED:
        LOG_INF("USB_DC_DISCONNECTED received, setting usb_configured = false");
        usb_configured = false;
        break;
    default:
        break;
    }
}
void send_battery_level(uint32_t voltage) {
// Prepare 8-byte payload
    // Prepare 8-byte payload with packet type 0x06 for battery voltage
    uint8_t payload_data[8] = {0x06}; // Packet type 0x06 for voltage
    memcpy(payload_data + 1, &voltage, sizeof(voltage)); // Offset by 1 byte for packet type

    // Set payload length and copy to tx_payload
    tx_payload.length = sizeof(payload_data);
    memcpy(tx_payload.data, payload_data, sizeof(payload_data));

    // Send via ESB
    int err = esb_write_payload(&tx_payload);
    if (err == 0) {
        LOG_INF("TX -> Voltage: %d mV", voltage);
        pulse_led(LED_GREEN, 400,2); // Replace blink
    } else {
        pulse_led(LED_RED, 300,2); // Replace blink
    }
    set_led_status(LED_OFF);
}
void sample_and_transmit(struct esb_evt const *event) {
    static uint8_t last_payload_data[2] = {0};
    uint8_t payload_data[2] = {0}; // Example test payload
    if (payload_data[0] != last_payload_data[0] || payload_data[1] != last_payload_data[1]) {
        tx_payload.length = sizeof(payload_data);
        memcpy(tx_payload.data, payload_data, sizeof(payload_data));
        last_payload_data[0] = payload_data[0];
        last_payload_data[1] = payload_data[1];
        if (esb_write_payload(&tx_payload) == 0) {
            LOG_INF("TX -> D+: %d, D-: %d", payload_data[0], payload_data[1]);
        } else {
            LOG_ERR("ESB write payload failed");
        }
    }
}

void send_windows_key(void) {
    uint8_t hid_report[8] = {0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}; // Left GUI only
    tx_payload.length = 8;
    memcpy(tx_payload.data, hid_report, 8);
    if (esb_write_payload(&tx_payload) == 0) {
        LOG_INF("TX -> Windows key press sent");
        pulse_led(LED_GREEN, 600,2);
    } else {
        LOG_ERR("Failed to send Windows key press, ESB error");
    }

    k_sleep(K_MSEC(100)); // Delay to ensure key is registered
    memset(hid_report, 0, 8); // Clear all bytes for key release
    tx_payload.length = 8;
    memcpy(tx_payload.data, hid_report, 8);
    if (esb_write_payload(&tx_payload) == 0) {
        LOG_INF("TX -> Windows key release sent");
    } else {
        LOG_ERR("Failed to send Windows key release, ESB error");
    }
}

void post_init_callback(struct k_timer *timer)
{
    if (!initialization_complete) {
        LOG_WRN("Post-init attempted before peripherals ready. Retrying...");
        k_timer_start(&post_init_timer, K_MSEC(100), K_NO_WAIT);
        return;
    }

}
int main(void)
{
    int err;
    int i=20;
    LOG_INF("Starting 2.4GHz HID Keyboard Transmitter");
    
    hid_dev = device_get_binding("HID_0");
    LOG_INF("USB device found and ready.");

    usb_hid_register_device(hid_dev, hid_report_desc, sizeof(hid_report_desc), NULL);
    LOG_INF("HID registered.");

    err = usb_hid_init(hid_dev);
    if (err)
    {
        LOG_ERR("Failed to init USB HID, err %d", err);
        return 0;
    }
    LOG_INF("HID initialized.");

    LOG_INF("Attempting to enable USB...");
    if (IS_ENABLED(CONFIG_USB_DEVICE_STACK))
    {
        err = usb_enable(NULL);
        if (err)
        {
            LOG_ERR("Failed to enable USB, err %d", err);
            return 0;
        }
        LOG_INF("USB enabled successfully.");
    }
    esb_config.protocol = ESB_PROTOCOL_ESB_DPL;
    esb_config.mode = ESB_MODE_PTX;
    esb_config.bitrate = ESB_BITRATE_2MBPS;
    esb_config.payload_length = 8;
    esb_config.retransmit_count = 5;
    esb_config.retransmit_delay = 100;
    esb_config.tx_output_power = ESB_TX_POWER_6DBM;
    esb_config.event_handler = sample_and_transmit;
    err = esb_init(&esb_config);
    if (err)
    {LOG_ERR("ESB initialization failed, err %d", err);}
    uint8_t base_addr_0[4] = {0xAB, 0x12, 0xCD, 0x34};
    err = esb_set_base_address_0(base_addr_0);
    if (err)
    {LOG_ERR("Failed to set base address 0");}
    uint8_t prefixes[8] = {0xA1, 0xA2, 0xA3, 0xA4, 0xA5, 0xA6, 0xA7, 0xA8};
    err = esb_set_prefixes(prefixes, 8);
    if (err)
    {LOG_ERR("Failed to set prefixes");}
    LOG_INF("Transmitter initialized successfully");

    /* // Initialize GPIOs 
    if (!device_is_ready(data_plus.port) || !device_is_ready(data_minus.port))
    {LOG_ERR("Data GPIOs not ready");}
    else {LOG_INF("Data GPIOs ready: D+ pin %d, D- pin %d", data_plus.pin, data_minus.pin);}

    gpio_pin_configure_dt(&data_plus, GPIO_INPUT);
    gpio_pin_configure_dt(&data_minus, GPIO_INPUT | GPIO_PULL_UP);

    * //Initialize RGB LED 
    if (!device_is_ready(red_led.port) || !device_is_ready(green_led.port) || !device_is_ready(blue_led.port))
    {LOG_ERR("RGB LED GPIOs not ready");}
    else { LOG_INF("RGB LED GPIOs ready: Red pin %d, Green pin %d, Blue pin P1.0%d", red_led.pin, green_led.pin, blue_led.pin);}

    gpio_pin_configure_dt(&red_led, GPIO_OUTPUT);
    gpio_pin_configure_dt(&green_led, GPIO_OUTPUT);
    gpio_pin_configure_dt(&blue_led, GPIO_OUTPUT);
 */// PWM Calibration
   // PWM Calibration
   
    // Initialize all PWM channels to off
    pwm_set_dt(&pwm_red, max_period, 0);
    pwm_set_dt(&pwm_green, max_period, 0);
    pwm_set_dt(&pwm_blue, max_period, 0);
    LOG_INF("ALL LEDS INITIALIZED OFF RED: %d, GREEN: %d, BLUE: %d (0 duty cycle)", 0, 0, 0);
    //k_timer_start(&led_timer, K_SECONDS(5), K_NO_WAIT);
    /* Configure GPIO Interrupt for Wake-up */
    static struct gpio_callback pin_cb_data;
    //gpio_init_callback(&pin_cb_data, pin_activity_handler, BIT(data_plus.pin) | BIT(data_minus.pin));
    /* err = gpio_add_callback(data_plus.port, &pin_cb_data);
    if (err)
    {LOG_ERR("Failed to add callback, err %d", err);} */

 /*    gpio_pin_interrupt_configure_dt(&data_plus, GPIO_INT_EDGE_BOTH);
    gpio_pin_interrupt_configure_dt(&data_minus, GPIO_INT_EDGE_BOTH); */

    if (!esb_is_idle()) {
        LOG_WRN("ESB not idle, flushing buffers");
        esb_flush_tx();
        esb_flush_rx();
    }
    err = esb_start_tx();
    if (err)
    {LOG_ERR("ESB start_tx failed: %d", err);}
    LOG_INF("ESB started, waiting for data...");
    LOG_INF("Pulsing blue LED to indicate ESB connect attempt...");
    //pulse_led(LED_BLUE, 250, 3);

    //check_battery_status();
    //pulse_led(LED_OFF, 2000, 8);
    LOG_INF("ALL LEDS SHOULD BE OFF (0 duty cycle)");
    set_led_status(LED_OFF);
    k_sleep(K_SECONDS(1)); 

    LOG_INF("GREEN LED should be ON (100 duty cycle)");
    set_led_status(LED_GREEN);
    k_sleep(K_SECONDS(1));

    LOG_INF("GREEN LED should be OFF (0 duty cycle)");
    set_led_status(LED_OFF);

    LOG_INF("BLUE LED should be ON (100 duty cycle)");
    set_led_status(LED_BLUE);
    k_sleep(K_SECONDS(1));
    LOG_INF("BLUE LED should be OFF (0 duty cycle)");
    set_led_status(LED_OFF);

    LOG_INF("MAGENTA LED should be ON (100 duty cycle)");
    set_led_status(LED_MAGENTA);
    k_sleep(K_SECONDS(1));
    LOG_INF("MAGENTA LED should be OFF (0 duty cycle)");
    set_led_status(LED_OFF);

   while(i!=0) {
    check_battery_status(); 
    LOG_INF("RED LED should pulse ON/OFF for 1 second/3 times");
    pulse_led(LED_RED, 2000,3);
    LOG_INF("GREEN LED should pulse ON/OFF for 1 seconds/3 times");
    pulse_led(LED_GREEN, 2000,3);
    LOG_INF("BLUE LED should pulse ON/OFF for 1 seconds/3 times");
    pulse_led(LED_BLUE, 2000,3);
    i--;
    } 
    k_timer_start(&battery_check_timer, K_NO_WAIT, K_MINUTES(1));

    return 0;
}